#### Terraform Format 🖌 ``
#### Terraform Validate 🤖 ``
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.resource_group["rg-demo"].random_uuid.telemetry[0]: Refreshing state... [id=5b8eebef-5f41-22c1-88a7-cfdf43855c59]
module.resource_group["rg-demo"].data.modtm_module_source.telemetry[0]: Reading...
module.resource_group["rg-demo"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group["rg-demo"].data.azurerm_subscription.current: Reading...
module.resource_group["rg-demo"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo]
module.resource_group["rg-demo"].data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group["rg-demo"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.resource_group["rg-demo"].modtm_telemetry.telemetry[0]: Refreshing state... [id=c419bba3-a09f-4cb8-831e-deef8f96544c]
module.resource_group["rg-demo"].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d]
module.nsg["nsg-web"].data.modtm_module_source.telemetry[0]: Reading...
module.nsg["nsg-web"].random_uuid.telemetry[0]: Refreshing state... [id=a341633d-9529-de8f-62e8-b5f49ff362b4]
module.nsg["nsg-web"].azurerm_network_security_group.this: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web]
module.vnet["vnet-demo"].data.modtm_module_source.telemetry[0]: Reading...
module.vnet["vnet-demo"].random_uuid.telemetry[0]: Refreshing state... [id=2ffb5c2b-898c-8690-ec11-62d030b5038b]
module.vnet["vnet-demo"].data.azurerm_client_config.telemetry[0]: Reading...
module.vnet["vnet-demo"].data.azurerm_client_config.this: Reading...
module.nsg["nsg-web"].data.azurerm_client_config.telemetry[0]: Reading...
module.nsg["nsg-web"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vnet["vnet-demo"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vnet["vnet-demo"].data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.nsg["nsg-web"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vnet["vnet-demo"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vnet["vnet-demo"].azapi_resource.vnet: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo]
module.vnet["vnet-demo"].modtm_telemetry.telemetry[0]: Refreshing state... [id=c6d49b22-7493-4a34-8d6e-e48776549069]
module.nsg["nsg-web"].modtm_telemetry.telemetry[0]: Refreshing state... [id=64919929-0029-47f5-b3e2-fac155bb2d1a]
module.nsg["nsg-web"].azurerm_network_security_rule.this["SSH"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web/securityRules/SSH]
module.vnet["vnet-demo"].module.subnet["subnet-public"].azapi_resource.subnet: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public]
module.vm["vm-web2"].data.azurerm_client_config.telemetry[0]: Reading...
module.vm["vm-web"].data.modtm_module_source.telemetry[0]: Reading...
module.vm["vm-web2"].data.modtm_module_source.telemetry[0]: Reading...
module.vm["vm-web"].tls_private_key.this[0]: Refreshing state... [id=22444ef2c26b67e6dfa9b21f92cea2c5952f1fe3]
module.vm["vm-web2"].tls_private_key.this[0]: Refreshing state... [id=f750c6c93fce65bf7ec2c2f6f2c0a591d097f69d]
module.vm["vm-web2"].random_uuid.telemetry[0]: Refreshing state... [id=b3b75ffd-f903-466d-69c2-67f324a661af]
module.vm["vm-web2"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/publicIPAddresses/vm-web-test2-publicip]
module.vm["vm-web"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vm["vm-web"].random_uuid.telemetry[0]: Refreshing state... [id=54105f7b-ad00-c1ee-1d2c-71f2fd89abfc]
module.vm["vm-web"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/publicIPAddresses/vm-web-dgc-publicip]
module.vm["vm-web"].data.azurerm_client_config.telemetry[0]: Reading...
module.vm["vm-web2"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vm["vm-web2"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.vm["vm-web"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.vm["vm-web2"].modtm_telemetry.telemetry[0]: Refreshing state... [id=55d191c4-d92f-4aaf-a775-7cabf4fc4814]
module.vm["vm-web"].modtm_telemetry.telemetry[0]: Refreshing state... [id=5055bfd5-63f0-4092-98b1-4206090d65b5]
module.vm["vm-web"].azurerm_network_interface.virtualmachine_network_interfaces["nic"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-dgc-nic]
module.vm["vm-web2"].azurerm_network_interface.virtualmachine_network_interfaces["nic"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic]
module.vm["vm-web2"].azurerm_network_interface_security_group_association.this["nic-nsg_association"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic|/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web]
module.vm["vm-web"].azurerm_network_interface_security_group_association.this["nic-nsg_association"]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-dgc-nic|/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web]
module.vm["vm-web"].azurerm_linux_virtual_machine.this[0]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-dgc]
module.vm["vm-web2"].azurerm_linux_virtual_machine.this[0]: Refreshing state... [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vm["vm-web"].azurerm_linux_virtual_machine.this[0] has been deleted
  - resource "azurerm_linux_virtual_machine" "this" {
      - admin_username                                         = "azureuser" -> null
      - allow_extension_operations                             = true -> null
      - bypass_platform_safety_checks_on_user_schedule_enabled = false -> null
      - computer_name                                          = "vm-web-dgc" -> null
      - disable_password_authentication                        = true -> null
      - disk_controller_type                                   = "SCSI" -> null
      - encryption_at_host_enabled                             = false -> null
      - extensions_time_budget                                 = "PT1H30M" -> null
      - id                                                     = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-dgc" -> null
      - location                                               = "eastus" -> null
      - max_bid_price                                          = -1 -> null
      - name                                                   = "vm-web-dgc" -> null
      - network_interface_ids                                  = [
          - "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-dgc-nic",
        ] -> null
      - os_managed_disk_id                                     = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/disks/vm-web-dgc-osdisk" -> null
      - patch_assessment_mode                                  = "ImageDefault" -> null
      - patch_mode                                             = "ImageDefault" -> null
      - platform_fault_domain                                  = -1 -> null
      - priority                                               = "Regular" -> null
      - private_ip_address                                     = "10.0.1.4" -> null
      - private_ip_addresses                                   = [
          - "10.0.1.4",
        ] -> null
      - provision_vm_agent                                     = true -> null
      - public_ip_address                                      = "4.156.245.107" -> null
      - public_ip_addresses                                    = [
          - "4.156.245.107",
        ] -> null
      - resource_group_name                                    = "rg-free-demo" -> null
      - secure_boot_enabled                                    = false -> null
      - size                                                   = "Standard_B1s" -> null
      - tags                                                   = {} -> null
      - virtual_machine_id                                     = "39bccb14-0935-424d-bdce-49eaced8b951" -> null
      - vm_agent_platform_updates_enabled                      = false -> null
      - vtpm_enabled                                           = false -> null
        # (13 unchanged attributes hidden)

      - admin_ssh_key {
          - public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEjOSWslXXlf5XcB6PQW4Eid+WYuIFVFldMRbBqGBfesHK0aI0JT3NXcDZnDtDLwqB/BiNDTF7JPNwip6XyV+Rs1ZpMMGW4bex7WZwydUyl/+rwmFYjGKsgEfRy3ExJ8CnQScVcQ4On6O04Y7twLCs2Oq1/V5NFpsr6M6yUi0Xbgly1Ox8BX8BifNC/kwF7I9hwrTfrDcONkXlzOnSiuxkJ82km+YDTKVNtfsli92Y3ghlE/zjjGna+NpCcuKbCGH8E86ypXmhX0bEVP0/x7jS4jTLmeFF37p0+IL/GqMpPXvjZdZ/LfSAS3O3rE9Nmmj+fi7ZTM0HSRdryy051IFkGGMC92D1wkU/6HKHAuPfq/PIF566i66eVDs2KpWak0CF4BAIe5buXivvbMWOz0vP36wrHc81QxhnRoY1ksHFSCSjbM8NJ6PLlhtUOz4vWVJnjL8KM0+mLZdFNxidpea7oqbzQddZpby0C626MQ9md9MEAk/m3ukLtXMWSw9SmqZknUMWozRkm0GgD6frANviOFHt9THrWjmY5FWBY7/cLua7xtRaL7AShzkMgJqIAD9vmqM8edG25Wcm34NTs34dfBTYIsNoI+DIn+Pi5r7B8EnwM1OUuINrbX/i5LfT1PSTghhETVwFR7Z5zszUaOOqkeUXT9L8DtmRpCRCwpvnSw== opc@dgc-gitops1
            EOT -> null
          - username   = "azureuser" -> null
        }

      - os_disk {
          - caching                          = "ReadWrite" -> null
          - disk_size_gb                     = 30 -> null
          - id                               = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/disks/vm-web-dgc-osdisk" -> null
          - name                             = "vm-web-dgc-osdisk" -> null
          - storage_account_type             = "Standard_LRS" -> null
          - write_accelerator_enabled        = false -> null
            # (3 unchanged attributes hidden)
        }

      - source_image_reference {
          - offer     = "0001-com-ubuntu-server-focal" -> null
          - publisher = "Canonical" -> null
          - sku       = "20_04-lts-gen2" -> null
          - version   = "latest" -> null
        }
    }

  # module.vm["vm-web2"].azurerm_linux_virtual_machine.this[0] has changed
  ~ resource "azurerm_linux_virtual_machine" "this" {
        id                                                     = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2"
        name                                                   = "vm-web-test2"
      + tags                                                   = {}
        # (40 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vm["vm-web"].azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-web-dgc2"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-web-dgc2"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-free-demo"
      + size                                                   = "Standard_B1s"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEjOSWslXXlf5XcB6PQW4Eid+WYuIFVFldMRbBqGBfesHK0aI0JT3NXcDZnDtDLwqB/BiNDTF7JPNwip6XyV+Rs1ZpMMGW4bex7WZwydUyl/+rwmFYjGKsgEfRy3ExJ8CnQScVcQ4On6O04Y7twLCs2Oq1/V5NFpsr6M6yUi0Xbgly1Ox8BX8BifNC/kwF7I9hwrTfrDcONkXlzOnSiuxkJ82km+YDTKVNtfsli92Y3ghlE/zjjGna+NpCcuKbCGH8E86ypXmhX0bEVP0/x7jS4jTLmeFF37p0+IL/GqMpPXvjZdZ/LfSAS3O3rE9Nmmj+fi7ZTM0HSRdryy051IFkGGMC92D1wkU/6HKHAuPfq/PIF566i66eVDs2KpWak0CF4BAIe5buXivvbMWOz0vP36wrHc81QxhnRoY1ksHFSCSjbM8NJ6PLlhtUOz4vWVJnjL8KM0+mLZdFNxidpea7oqbzQddZpby0C626MQ9md9MEAk/m3ukLtXMWSw9SmqZknUMWozRkm0GgD6frANviOFHt9THrWjmY5FWBY7/cLua7xtRaL7AShzkMgJqIAD9vmqM8edG25Wcm34NTs34dfBTYIsNoI+DIn+Pi5r7B8EnwM1OUuINrbX/i5LfT1PSTghhETVwFR7Z5zszUaOOqkeUXT9L8DtmRpCRCwpvnSw== opc@dgc-gitops1
            EOT
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "vm-web-dgc2-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm["vm-web"].azurerm_network_interface.virtualmachine_network_interfaces["nic"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "vm-web-dgc2-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-free-demo"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/virtualNetworks/vnet-free-demo/subnets/subnet-public"
        }
    }

  # module.vm["vm-web"].azurerm_network_interface_security_group_association.this["nic-nsg_association"] will be created
  + resource "azurerm_network_interface_security_group_association" "this" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web"
    }

  # module.vm["vm-web"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"] will be created
  + resource "azurerm_public_ip" "virtualmachine_public_ips" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 30
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "vm-web-dgc2-publicip"
      + resource_group_name     = "rg-free-demo"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.vm["vm-web2"].azurerm_linux_virtual_machine.this[0] must be replaced
-/+ resource "azurerm_linux_virtual_machine" "this" {
      ~ computer_name                                          = "vm-web-test2" -> "vm-web-test3" # forces replacement
      ~ disk_controller_type                                   = "SCSI" -> (known after apply)
      ~ id                                                     = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2" -> (known after apply)
      ~ name                                                   = "vm-web-test2" -> "vm-web-test3" # forces replacement
      ~ network_interface_ids                                  = [
          - "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic",
        ] -> (known after apply)
      ~ os_managed_disk_id                                     = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/disks/vm-web-test2-osdisk" -> (known after apply)
      ~ patch_mode                                             = "ImageDefault" -> (known after apply)
      ~ private_ip_address                                     = "10.0.1.5" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.0.1.5",
        ] -> (known after apply)
      ~ public_ip_address                                      = "4.255.77.231" -> (known after apply)
      ~ public_ip_addresses                                    = [
          - "4.255.77.231",
        ] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
      - tags                                                   = {} -> null
      ~ virtual_machine_id                                     = "caa4f9f9-5e17-48be-b8c4-b43cf52eab37" -> (known after apply)
      ~ vm_agent_platform_updates_enabled                      = false -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (27 unchanged attributes hidden)

      ~ os_disk {
          ~ id                               = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/disks/vm-web-test2-osdisk" -> (known after apply)
          ~ name                             = "vm-web-test2-osdisk" -> "vm-web-test3-osdisk" # forces replacement
            # (7 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (2 unchanged blocks hidden)
    }

  # module.vm["vm-web2"].azurerm_network_interface.virtualmachine_network_interfaces["nic"] must be replaced
-/+ resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      ~ applied_dns_servers            = [] -> (known after apply)
      - dns_servers                    = [] -> null
      ~ id                             = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic" -> (known after apply)
      ~ internal_domain_name_suffix    = "brgesu1s15aefoezuchxt2afwf.bx.internal.cloudapp.net" -> (known after apply)
      ~ mac_address                    = "00-0D-3A-53-85-CC" -> (known after apply)
      ~ name                           = "vm-web-test2-nic" -> "vm-web-test3-nic" # forces replacement
      ~ private_ip_address             = "10.0.1.5" -> (known after apply)
      ~ private_ip_addresses           = [
          - "10.0.1.5",
        ] -> (known after apply)
      - tags                           = {} -> null
      ~ virtual_machine_id             = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig1"
          ~ private_ip_address                                 = "10.0.1.5" -> (known after apply)
          ~ public_ip_address_id                               = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/publicIPAddresses/vm-web-test2-publicip" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.vm["vm-web2"].azurerm_network_interface_security_group_association.this["nic-nsg_association"] must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "this" {
      ~ id                        = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic|/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkSecurityGroups/nsg-web" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/networkInterfaces/vm-web-test2-nic" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vm["vm-web2"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"] must be replaced
-/+ resource "azurerm_public_ip" "virtualmachine_public_ips" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Network/publicIPAddresses/vm-web-test2-publicip" -> (known after apply)
      ~ ip_address              = "4.255.77.231" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "vm-web-test2-publicip" -> "vm-web-test3-publicip" # forces replacement
      - tags                    = {} -> null
        # (10 unchanged attributes hidden)
    }

Plan: 8 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ resource_ids       = {
      ~ virtual_machines = {
          ~ vm-web  = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-dgc" -> (known after apply)
          ~ vm-web2 = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2" -> (known after apply)
        }
        # (4 unchanged attributes hidden)
    }
  ~ virtual_machines   = {
      ~ vm-web  = {
          ~ id           = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-dgc" -> (known after apply)
          ~ name         = "vm-web-dgc" -> "vm-web-dgc2"
            # (3 unchanged attributes hidden)
        }
      ~ vm-web2 = {
          ~ id           = "/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d/resourceGroups/rg-free-demo/providers/Microsoft.Compute/virtualMachines/vm-web-test2" -> (known after apply)
          ~ name         = "vm-web-test2" -> "vm-web-test3"
            # (3 unchanged attributes hidden)
        }
    }

Warning: Attribute Deprecated

  with module.vnet["vnet-demo"].azapi_resource.vnet,
  on .terraform/modules/vnet/main.virtual.network.tf line 1, in resource "azapi_resource" "vnet":
   1: resource "azapi_resource" "vnet" {

The `multiplier` attribute is deprecated and will be removed in a future
version.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @iblake*